vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <name>LPC865_DFP</name>
  <vendor>NXP</vendor>
  <description>Device Family Pack for LPC865</description>
  <url>https://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <license>Licenses.txt</license>
  <releases>
    <release version="25.09.00" date="2025-09-19">NXP CMSIS Packs based on MCUXpresso SDK 25.09.00</release>
    <release version="25.06.00" date="2025-06-24">NXP CMSIS Packs based on MCUXpresso SDK 25.06.00</release>
    <release version="25.03.00" date="2025-03-28">NXP CMSIS Packs based on MCUXpresso SDK 25.03.00</release>
    <release version="19.0.0" date="2024-07-17">NXP CMSIS Packs based on MCUXpresso SDK 2.16.0</release>
    <release version="18.0.0" date="2024-01-14">NXP CMSIS Packs based on MCUXpresso SDK 2.15.0</release>
    <release version="16.0.0" date="2023-07-27">NXP CMSIS Packs based on MCUXpresso SDK 2.13.1</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <requirements>
    <packages>
      <package name="CMSIS" vendor="ARM" version="6.1.0"/>
    </packages>
    <languages>
      <language name="C" version="99"/>
    </languages>
  </requirements>
  <devices>
    <family Dfamily="LPC865" Dvendor="NXP:11">
      <debugvars configfile="devices/LPC865/arm/LPC86x.dbgconf">
        // Debug Access Variables, can be modified by user via copies of DBGCONF files as created by uVision. Also see sub-family level.
        __var Dbg_CR                = 0x00000000;                            // DBG_CR
      </debugvars>
      <sequences>
        <sequence name="DebugDeviceUnlock">
          <block>
            __var value = 0;
            
            value  = Read32(0x40048080);                                     // Read SYSAHBCLKCTRL0
            value |= (1 &lt;&lt; 26);                                        // Enable MTB Control Register Clock
            Write32(0x40048080, value);                                      // Write modified value to SYSAHBCLKCTRL0
          </block>
        </sequence>
        <sequence name="ResetCatchSet">
          <block>
            __var SCS_Addr   = 0xE000E000;
            __var DHCSR_Addr = SCS_Addr + 0xDF0;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            __var FPB_BKPT_H = 0x80000000;
            __var FPB_BKPT_L = 0x40000000;
            __var FPB_COMP_M = 0x1FFFFFFC;
            __var FPB_KEY    = 0x00000002;
            __var FPB_ENABLE = 0x00000001;
          </block>
          <control if="Dbg_CR == 0x00000000" info="Stop after bootloader disabled">
            <block>
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value | 0x00000001));                     // Enable Reset Vector Catch in DEMCR
            </block>
          </control>
          <control if="Dbg_CR == 0x00000001" info="Stop after bootloader enabled">
            <block>
              value = Read32(DEMCR_Addr);
              Write32(DEMCR_Addr, (value &amp; (~0x00000001)));              // Disable Reset Vector Catch in DEMCR
            </block>
            <control if="value &lt; 0x20000000" info="Set and enable breakpoint">
              <block>
                Write32(0x40048000, 0x00000002);                             // Map Flash to Vectors
                value = Read32 (0x00000004);                                 // Read Reset Vector
                
                value = ((value &amp; 0x02) ? FPB_BKPT_H : FPB_BKPT_L) | (value &amp; FPB_COMP_M) | FPB_ENABLE ;
                Write32(0xE0002008, value);                                  // Set BP0 to Reset Vector
                Write32(0xE0002000, (FPB_KEY | FPB_ENABLE));                 // Enable FPB
              </block>
            </control>
            <control if="value &gt;= 0x20000000" info="Enable reset vector catch">
              <block>
                value = Read32(DEMCR_Addr);
                Write32(DEMCR_Addr, (value | 0x00000001));                   // Enable Reset Vector Catch in DEMCR
              </block>
            </control>
          </control>
          <block>
            Read32(DHCSR_Addr);                                              // Read DHCSR to clear potentially set DHCSR.S_RESET_ST bit
          </block>
        </sequence>
        <sequence name="ResetCatchClear">
          <block>
            // System Control Space (SCS) offset as defined in ARMv6-M/ARMv7-M.
            // Reimplement this sequence if the SCS is located at a different offset.
            __var SCS_Addr   = 0xE000E000;
            __var DEMCR_Addr = SCS_Addr + 0xDFC;
            __var value      = 0;
            
            value = Read32(DEMCR_Addr);
            Write32(DEMCR_Addr, (value &amp; (~0x00000001)));                // Disable Reset Vector Catch in DEMCR
            
            Write32(0xE0002008, 0);                                          // Clear BP0
            Write32(0xE0002000, 0x00000002);                                 // Disable FPB
          </block>
        </sequence>
      </sequences>
      <description>Low-Cost Microcontrollers (MCUs) based on Arm Cortex-M0+ Core</description>
      <device Dname="LPC865">
        <processor Dcore="Cortex-M0+" Dfpu="NO_FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="48000000"/>
        <environment name="iar">
          <file category="linkerfile" name="devices/LPC865/iar/LPC865_flash.icf"/>
        </environment>
        <memory name="IAP_SRAM" start="0x10001fe0" size="0x20" access="rw"/>
        <memory name="PROGRAM_FLASH" start="0x00000000" size="0x010000" access="rx" default="1" startup="1"/>
        <memory name="SRAM" start="0x10000000" size="0x1fe0" access="rw" default="1"/>
        <algorithm name="devices/LPC865/arm/LPC860_64.FLM" start="0x0" size="0x10000" RAMstart="0x10000000" RAMsize="0x1000" default="1"/>
        <debug svd="devices/LPC865/LPC865.xml">
          <datapatch address="0xf0000000" __dp="0" __ap="0" value="0x6000c002" info="1st entry should be invalid"/>
        </debug>
        <variant Dvariant="LPC865M201JBD64">
          <compile header="devices/LPC865/fsl_device_registers.h" define="CPU_LPC865M201JBD64"/>
        </variant>
        <variant Dvariant="LPC865M201JHI48">
          <compile header="devices/LPC865/fsl_device_registers.h" define="CPU_LPC865M201JHI48"/>
        </variant>
        <variant Dvariant="LPC865M201JHI33">
          <compile header="devices/LPC865/fsl_device_registers.h" define="CPU_LPC865M201JHI33"/>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="device.LPC865.internal_condition">
      <accept Dname="LPC865M201JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC865M201JHI33" Dvendor="NXP:11"/>
      <accept Dname="LPC865M201JHI48" Dvendor="NXP:11"/>
    </condition>
    <condition id="cmake_toolchain.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.device=LPC865.internal_condition">
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux_pca954x, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
