vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
    <condition id="component.button.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter, component.timer_manager, device=LPC865.internal_condition">
      <require condition="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_gpio_adapter, driver.lpc_gpio, allOf=anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <accept condition="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition"/>
      <accept condition="allOf.anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_gpio_adapter, driver.lpc_gpio.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_gpio_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpc_gpio, component.rt_gpio_adapter.internal_condition">
      <require condition="anyOf.driver.lpc_gpio.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter"/>
    </condition>
    <condition id="anyOf.driver.lpc_gpio.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
    </condition>
    <condition id="component.eeprom_AT25Fxxxx.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="component.eeprom_AT45DBxxxx.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="component.eeprom_InternalFlash.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9544.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=LPC865.internal_condition"/>
    </condition>
    <condition id="component.enable_pca9548.condition_id">
      <require condition="allOf.component.i2c_mux_pca954x, device=LPC865.internal_condition"/>
    </condition>
    <condition id="component.ftm_adapter.condition_id">
      <require condition="allOf.driver.ftm, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.ftm, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ftm"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.i2c_adapter_interface.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_i2c_adapter, driver.lpc_i2c, allOf=component.i3c_adapter, driver.i3c, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.lpc_i2c_adapter, driver.lpc_i2c, allOf=component.i3c_adapter, driver.i3c, device=LPC865.internal_condition">
      <require condition="anyOf.allOf=component.lpc_i2c_adapter, driver.lpc_i2c, allOf=component.i3c_adapter, driver.i3c.internal_condition"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.lpc_i2c_adapter, driver.lpc_i2c, allOf=component.i3c_adapter, driver.i3c.internal_condition">
      <accept condition="allOf.component.lpc_i2c_adapter, driver.lpc_i2c.internal_condition"/>
      <accept condition="allOf.component.i3c_adapter, driver.i3c.internal_condition"/>
    </condition>
    <condition id="allOf.component.lpc_i2c_adapter, driver.lpc_i2c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lpc_i2c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="allOf.component.i3c_adapter, driver.i3c.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
    </condition>
    <condition id="component.i2c_mux.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="component.i2c_mux_pca954x.condition_id">
      <require condition="allOf.component.i2c_mux, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_mux, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.i3c_adapter.condition_id">
      <require condition="allOf.component.i2c_adapter_interface, driver.i3c, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.component.i2c_adapter_interface, driver.i3c, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.i3c_bus.condition_id">
      <require condition="allOf.component.lists, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.component.lists, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.i3c_bus_adapter.condition_id">
      <require condition="allOf.component.i3c_bus, driver.i3c, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.component.i3c_bus, driver.i3c, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_bus"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.led.condition_id">
      <require condition="allOf.anyOf=allOf=component.lpc_gpio_adapter, driver.lpc_gpio, component.timer_manager, driver.common, device=LPC865.internal_condition"/>
    </condition>
