vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
    <condition id="component.software_rng_adapter.condition_id">
      <require condition="allOf.component.rng_adapter_interface, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.component.rng_adapter_interface, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="component.timer_manager.condition_id">
      <require condition="allOf.anyOf=allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt, component.lists, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt, component.lists, driver.common, device=LPC865.internal_condition">
      <require condition="anyOf.allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="lists"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="anyOf.allOf=component.ftm_adapter, driver.ftm, allOf=component.mrt_adapter, driver.mrt.internal_condition">
      <accept condition="allOf.component.ftm_adapter, driver.ftm.internal_condition"/>
      <accept condition="allOf.component.mrt_adapter, driver.mrt.internal_condition"/>
    </condition>
    <condition id="allOf.component.ftm_adapter, driver.ftm.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ftm_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="ftm"/>
    </condition>
    <condition id="allOf.component.mrt_adapter, driver.mrt.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt_adapter"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="mrt"/>
    </condition>
    <condition id="device.CMSIS.condition_id">
      <require condition="allOf.CMSIS_Include_core_cm, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.CMSIS_Include_core_cm, device=LPC865.internal_condition">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="device.RTE.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="device_id.LPC865.internal_condition">
      <accept Dname="LPC865M201JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC865M201JHI33" Dvendor="NXP:11"/>
      <accept Dname="LPC865M201JHI48" Dvendor="NXP:11"/>
    </condition>
    <condition id="device.linker.condition_id">
      <require condition="allOf.device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.device_id=LPC865.internal_condition">
      <require condition="device_id.LPC865.internal_condition"/>
    </condition>
    <condition id="device_ids.LPC865.internal_condition">
      <accept Dname="LPC865M201JBD64" Dvendor="NXP:11"/>
      <accept Dname="LPC865M201JHI33" Dvendor="NXP:11"/>
      <accept Dname="LPC865M201JHI48" Dvendor="NXP:11"/>
    </condition>
    <condition id="allOf.toolchains=mdk, device_ids=LPC865.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
      <require condition="device_ids.LPC865.internal_condition"/>
    </condition>
    <condition id="toolchains.mdk.internal_condition">
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, device_ids=LPC865.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
      <require condition="device_ids.LPC865.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc.internal_condition">
      <accept Tcompiler="GCC"/>
    </condition>
    <condition id="allOf.toolchains=iar, device_ids=LPC865.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
      <require condition="device_ids.LPC865.internal_condition"/>
    </condition>
    <condition id="toolchains.iar.internal_condition">
      <accept Tcompiler="IAR"/>
    </condition>
    <condition id="device.project_template.condition_id">
      <require condition="allOf.component.miniusart_adapter, device_id=LPC865, driver.common, device.startup, driver.clock, driver.power, driver.reset, driver.swm, driver.lpc_gpio, driver.lpc_iocon_lite, driver.lpc_miniusart, driver.syscon_connections, driver.swm_connections, utility.assert_lite, utility.debug_console_lite.internal_condition"/>
    </condition>
    <condition id="allOf.component.miniusart_adapter, device_id=LPC865, driver.common, device.startup, driver.clock, driver.power, driver.reset, driver.swm, driver.lpc_gpio, driver.lpc_iocon_lite, driver.lpc_miniusart, driver.syscon_connections, driver.swm_connections, utility.assert_lite, utility.debug_console_lite.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="miniusart_adapter"/>
      <require condition="device_id.LPC865.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="Startup" Csub=""/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="power"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="reset"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="swm"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="iocon"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="syscon_connections"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="swm_connections"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="assert_lite"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
    </condition>
