vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
    <condition id="device.startup.condition_id">
      <require condition="allOf.device.system, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.device.system, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC865_system"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=iar.condition_id">
      <require condition="toolchains.iar.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc.condition_id">
      <require condition="toolchains.armgcc.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=mdk.condition_id">
      <require condition="toolchains.mdk.internal_condition"/>
    </condition>
    <condition id="device.system.condition_id">
      <require condition="allOf.device.CMSIS, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.device.CMSIS, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="CMSIS" Csub="LPC865_header"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="driver.clock.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.common.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.cores=cm0p.condition_id">
      <require condition="cores.cm0p.internal_condition"/>
    </condition>
    <condition id="cores.cm0p.internal_condition">
      <accept Dcore="Cortex-M0+"/>
    </condition>
    <condition id="driver.ftm.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, device_id=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device_id.LPC865.internal_condition"/>
    </condition>
    <condition id="driver.fxas21002cq.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition">
      <require condition="anyOf.driver.lpc_i2c.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpc_i2c.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="driver.fxls8974cf.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.fxos8700cq.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.htu21d.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.i3c.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.i3c_dma.condition_id">
      <require condition="allOf.driver.i3c, driver.lpc_dma, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.i3c, driver.lpc_dma, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i3c"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dma"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="driver.iap.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.icm42688p.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.inputmux.condition_id">
      <require condition="allOf.driver.common, driver.inputmux_connections, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.inputmux_connections, device_id=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="inputmux_connections"/>
      <require condition="device_id.LPC865.internal_condition"/>
    </condition>
    <condition id="driver.inputmux_connections.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_acomp.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_adc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_crc.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_dma.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_gpio.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_i2c.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_iocon_lite.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_minispi.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.lpc_miniusart.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
