vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
    <condition id="driver.lsm6dso.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.max30101.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.mma8451q.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.mma8652fc.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.mrt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.nmh1000.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.p3t1755.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.pint.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.power.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.reset.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.swm.condition_id">
      <require condition="allOf.driver.common, driver.swm_connections, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.swm_connections, device_id=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="swm_connections"/>
      <require condition="device_id.LPC865.internal_condition"/>
    </condition>
    <condition id="driver.swm_connections.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.syscon.condition_id">
      <require condition="allOf.driver.common, driver.syscon_connections, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, driver.syscon_connections, device_id=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="syscon_connections"/>
      <require condition="device_id.LPC865.internal_condition"/>
    </condition>
    <condition id="driver.syscon_connections.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.tsl2561.condition_id">
      <require condition="allOf.anyOf=driver.lpc_i2c, driver.common, device=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.wkt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="driver.wwdt.condition_id">
      <require condition="allOf.driver.common, device_id=LPC865.internal_condition"/>
    </condition>
    <condition id="middleware.baremetal.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="utilities.misc_utilities.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="utility.assert_lite.condition_id">
      <require condition="allOf.driver.common, utility.debug_console_lite, component.miniusart_adapter, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.driver.common, utility.debug_console_lite, component.miniusart_adapter, device=LPC865.internal_condition">
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console_lite"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="miniusart_adapter"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="utility.debug_console_lite.condition_id">
      <require condition="allOf.anyOf=driver.lpc_miniusart, driver.common, utility.str, component.miniusart_adapter, device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.anyOf=driver.lpc_miniusart, driver.common, utility.str, component.miniusart_adapter, device=LPC865.internal_condition">
      <require condition="anyOf.driver.lpc_miniusart.internal_condition"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="str"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="miniusart_adapter"/>
      <require condition="device.LPC865.internal_condition"/>
    </condition>
    <condition id="anyOf.driver.lpc_miniusart.internal_condition">
      <accept Cclass="Device" Cgroup="SDK Drivers" Csub="usart"/>
    </condition>
    <condition id="utility.incbin.condition_id">
      <require condition="allOf.device=LPC865.internal_condition"/>
    </condition>
    <condition id="allOf.toolchains=armgcc, mdk.condition_id">
      <require condition="toolchains.armgcc, mdk.internal_condition"/>
    </condition>
    <condition id="toolchains.armgcc, mdk.internal_condition">
      <accept Tcompiler="GCC"/>
      <accept Tcompiler="ARMCC"/>
    </condition>
    <condition id="utility.str.condition_id">
      <require condition="allOf.driver.common, device=LPC865.internal_condition"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="cmake_toolchain" Cversion="1.0.0" condition="cmake_toolchain.condition_id">
      <description>Cmake_toolchain</description>
      <files>
        <file category="other" name="tools/cmake_toolchain_files/armgcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xcc.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/xclang.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/armgcc_force_cpp.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/mcux_config.cmake" projectpath="cmake_toolchain_files"/>
        <file category="other" name="tools/cmake_toolchain_files/riscvllvm.cmake" projectpath="cmake_toolchain_files"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="one_i2c_mux_device_enabled" Cversion="1.0.0" condition="component.at_least_one_i2c_mux_device_enabled.condition_id">
      <description>Component at_least_one_i2c_mux_device_enabled</description>
      <files>
        <file category="doc" name="components/i2c/muxes/component.at_least_one_i2c_mux_device_enabled_dummy.txt"/>
      </files>
    </component>
