vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="button" Cversion="1.0.0" condition="component.button.condition_id">
      <description>Component button</description>
      <files>
        <file category="header" name="components/button/fsl_component_button.h" projectpath="component/button"/>
        <file category="sourceC" name="components/button/fsl_component_button.c" projectpath="component/button"/>
        <file category="include" name="components/button/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT25Fxxxx" Cversion="1.0.0" condition="component.eeprom_AT25Fxxxx.condition_id">
      <description>Component eeprom_at25fxxxx</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_AT25Fxxxx_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_AT45DBxxxx" Cversion="1.0.0" condition="component.eeprom_AT45DBxxxx.condition_id">
      <description>Component eeprom_at45dbxxxx</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_AT45DBxxxx_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="eeprom_InternalFlash" Cversion="1.0.0" condition="component.eeprom_InternalFlash.condition_id">
      <description>Component eeprom_internalflash</description>
      <files>
        <file category="doc" name="components/extern_flash/component.eeprom_InternalFlash_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enable_pca9544" Cversion="1.0.0" condition="component.enable_pca9544.condition_id">
      <description>Component enable_pca9544</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9544
#define MCUX_ENABLE_PCA9544 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/i2c/muxes/component.enable_pca9544_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="enable_pca9548" Cversion="1.0.0" condition="component.enable_pca9548.condition_id">
      <description>Component enable_pca9548</description>
      <RTE_Components_h>
#ifndef MCUX_ENABLE_PCA9548
#define MCUX_ENABLE_PCA9548 
#endif
</RTE_Components_h>
      <files>
        <file category="doc" name="components/i2c/muxes/component.enable_pca9548_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="ftm_adapter" Cversion="1.0.0" condition="component.ftm_adapter.condition_id">
      <description>Component ftm_adapter</description>
      <RTE_Components_h>
#ifndef TIMER_PORT_TYPE_FTM
#define TIMER_PORT_TYPE_FTM 1
#endif
</RTE_Components_h>
      <files>
        <file category="header" name="components/timer/fsl_adapter_timer.h" projectpath="component/timer"/>
        <file category="sourceC" name="components/timer/fsl_adapter_ftm.c" projectpath="component/timer"/>
        <file category="include" name="components/timer/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_adapter_interface" Cversion="1.0.0" condition="component.i2c_adapter_interface.condition_id">
      <description>Component i2c_adapter_interface</description>
      <files>
        <file category="header" name="components/i2c/fsl_adapter_i2c.h" projectpath="component/i2c"/>
        <file category="include" name="components/i2c/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux" Cversion="1.0.0" condition="component.i2c_mux.condition_id">
      <description>Component i2c_mux</description>
      <files>
        <file category="doc" name="components/i2c/muxes/component.i2c_mux_dummy.txt"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i2c_mux_pca954x" Cversion="1.0.0" condition="component.i2c_mux_pca954x.condition_id">
      <description>Component i2c_mux_pca954x</description>
      <files>
        <file category="header" name="components/i2c/muxes/fsl_pca954x.h" projectpath="component/i2c/muxes"/>
        <file category="sourceC" name="components/i2c/muxes/fsl_pca954x.c" projectpath="component/i2c/muxes"/>
        <file category="include" name="components/i2c/muxes/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_adapter" Cversion="1.0.0" condition="component.i3c_adapter.condition_id">
      <description>Component i3c_adapter</description>
      <RTE_Components_h>
        #ifndef SDK_I3C_BASED_COMPONENT_USED
        #define SDK_I3C_BASED_COMPONENT_USED 1
        #endif
      </RTE_Components_h>
      <files>
        <file category="sourceC" name="components/i2c/fsl_adapter_i3c.c" projectpath="component/i2c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_bus" Cversion="1.0.1" condition="component.i3c_bus.condition_id">
      <description>Component i3c_bus</description>
      <files>
        <file category="header" name="components/i3c_bus/fsl_component_i3c.h" projectpath="component/i3c_bus"/>
        <file category="sourceC" name="components/i3c_bus/fsl_component_i3c.c" projectpath="component/i3c_bus"/>
        <file category="include" name="components/i3c_bus/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="i3c_bus_adapter" Cversion="1.1.0" condition="component.i3c_bus_adapter.condition_id">
      <description>Component i3c_bus_adapter</description>
      <files>
        <file category="header" name="components/i3c_bus/fsl_component_i3c_adapter.h" projectpath="component/i3c_bus"/>
        <file category="sourceC" name="components/i3c_bus/fsl_component_i3c_adapter.c" projectpath="component/i3c_bus"/>
        <file category="include" name="components/i3c_bus/"/>
      </files>
    </component>
