vvpai9/Keil/Keil_v5/ARM/Pack/.Web/NXP.LPC865_DFP.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rng_adapter_interface" Cversion="1.0.0" condition="component.rng_adapter_interface.condition_id">
      <description>Component rng_adapter_interface</description>
      <files>
        <file category="header" name="components/rng/fsl_adapter_rng.h" projectpath="component/rng"/>
        <file category="include" name="components/rng/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rnga_adapter" Cversion="1.0.0" condition="component.rnga_adapter.condition_id">
      <description>Component rnga_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_rnga.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="rt_gpio_adapter" Cversion="1.0.1" condition="component.rt_gpio_adapter.condition_id">
      <description>Component rt_gpio_adapter</description>
      <files>
        <file category="header" name="components/gpio/fsl_adapter_gpio.h" projectpath="component/gpio"/>
        <file category="sourceC" name="components/gpio/fsl_adapter_rt_gpio.c" projectpath="component/gpio"/>
        <file category="include" name="components/gpio/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_crc_adapter" Cversion="1.0.0" condition="component.software_crc_adapter.condition_id">
      <description>Component software_crc_adapter</description>
      <files>
        <file category="header" name="components/crc/fsl_adapter_crc.h" projectpath="component/crc"/>
        <file category="sourceC" name="components/crc/fsl_adapter_software_crc.c" projectpath="component/crc"/>
        <file category="include" name="components/crc/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="software_rng_adapter" Cversion="1.0.0" condition="component.software_rng_adapter.condition_id">
      <description>Component software_rng_adapter</description>
      <files>
        <file category="sourceC" name="components/rng/fsl_adapter_software_rng.c" projectpath="component/rng"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Csub="timer_manager" Cversion="1.0.0" condition="component.timer_manager.condition_id">
      <description>Component timer_manager</description>
      <files>
        <file category="header" name="components/timer_manager/fsl_component_timer_manager.h" projectpath="component/timer_manager"/>
        <file category="sourceC" name="components/timer_manager/fsl_component_timer_manager.c" projectpath="component/timer_manager"/>
        <file category="include" name="components/timer_manager/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="CMSIS" Csub="LPC865_header" Cversion="1.0.0" condition="device.CMSIS.condition_id">
      <description>Device LPC865_cmsis</description>
      <files>
        <file category="header" name="devices/LPC865/fsl_device_registers.h" projectpath="device"/>
        <file category="header" name="devices/LPC865/LPC865.h" projectpath="device"/>
        <file category="header" name="devices/LPC865/LPC865_features.h" projectpath="device"/>
        <file category="header" name="devices/LPC865/LPC865_COMMON.h" projectpath="device"/>
        <file category="header" name="devices/LPC865/periph3/PERI_ACOMP.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_ADC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_CRC.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_DMA.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_FLASH_CTRL.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_FTM.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_GPIO.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_I2C.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_I3C.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_INPUTMUX.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_IOCON.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_MRT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_PINT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_PMU.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_SPI.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_SWM.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_SYSCON.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_USART.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_WKT.h" projectpath="device/periph3"/>
        <file category="header" name="devices/LPC865/periph3/PERI_WWDT.h" projectpath="device/periph3"/>
        <file category="include" name="devices/LPC865/"/>
        <file category="include" name="devices/LPC865/periph3/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device" Cversion="1.0.0" condition="device.RTE.condition_id">
      <description>Rte_device</description>
      <files>
        <file category="doc" name="devices/LPC865/template/device.RTE_dummy.txt"/>
        <file category="include" name="devices/LPC865/template/"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Utilities" Csub="LPC865_linker" Cversion="1.0.0" condition="device.linker.condition_id">
      <description>Device LPC865_linker</description>
      <files>
        <file condition="allOf.toolchains=mdk, device_ids=LPC865.condition_id" category="linkerScript" attr="config" name="devices/LPC865/arm/LPC865_flash.scf" version="1.0.0" projectpath="LPC865/arm"/>
        <file condition="allOf.toolchains=mdk, device_ids=LPC865.condition_id" category="linkerScript" attr="config" name="devices/LPC865/arm/LPC865_ram.scf" version="1.0.0" projectpath="LPC865/arm"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC865.condition_id" category="linkerScript" attr="config" name="devices/LPC865/gcc/LPC865_flash.ld" version="1.0.0" projectpath="LPC865/gcc"/>
        <file condition="allOf.toolchains=armgcc, device_ids=LPC865.condition_id" category="linkerScript" attr="config" name="devices/LPC865/gcc/LPC865_ram.ld" version="1.0.0" projectpath="LPC865/gcc"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC865.condition_id" category="linkerScript" attr="config" name="devices/LPC865/iar/LPC865_flash.icf" version="1.0.0" projectpath="LPC865/iar"/>
        <file condition="allOf.toolchains=iar, device_ids=LPC865.condition_id" category="linkerScript" attr="config" name="devices/LPC865/iar/LPC865_ram.icf" version="1.0.0" projectpath="LPC865/iar"/>
      </files>
    </component>
